# Books Core
Jacob Tanzi

## Part 1: Design an ERD

![png](erdbookcore.png)

## Part 2: Create the database in Python

Continue working in Jupyter Notebook with the ERD image.

Rather than creating the database in MySQL workbench with forward engineering, we are going to develop our Python skills by creating the database in Python using PyMySQL that you practiced in the "MySQL with Python" lesson.

Note that working with MySQL via Python will be a required component of the belt exam, so getting comfortable with it now will help prepare you!

You will need to create a connection. This time, you may wish to call it "books"

In [1]:
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [3]:
username = "root"
password = "2YfuwrYDDXACDYCTbdKR"

In [4]:
# connection = "mysql+pymysql://{username}:{password}@localhost/books"

In [5]:
connection = f'mysql+pymysql://{username}:{password}@localhost/books'
engine = create_engine(connection)

In [6]:
#engine = create_engine(connection)

In [7]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [8]:
engine

Engine(mysql+pymysql://root:***@localhost/books)

In [9]:
import pandas as pd
df_auth = pd.read_csv('data author.csv')
df_auth.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [10]:
df_fav = pd.read_csv('data favorite.csv')
df_fav.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [11]:
df_user = pd.read_csv('data user.csv')
df_user.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [12]:
df_book = pd.read_csv('data book.csv')
df_book.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [13]:
df_auth.to_sql('author', engine, if_exists = 'replace')

5

In [15]:
df_fav.to_sql('favorite', engine, if_exists = 'replace')

7

In [16]:
df_user.to_sql('user', engine, if_exists = 'replace')

3

In [18]:
df_book.to_sql('book', engine, if_exists = 'replace')

6

## Testing the Database

After creating your 4 tables, you should run the "SHOW TABLES;" query in your notebook.

As a final step to this task, write a query at the end of your Jupyter Notebook to list the titles of all of John Doe's favorite books. An example of the SQL syntax: Note this will depend on how you named your tables.

In [32]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0          author
1            book
2        favorite
3            user

In [33]:
q1 = """ SELECT * FROM book;"""
pd.read_sql(q1, engine)

   index  id                 title  author_id
0      0   1           The Shining          1
1      1   2                    It          1
2      2   3      The Great Gatsby          2
3      3   4  The Call of the Wild          3
4      4   5   Pride and Prejudice          4
5      5   6          Frankenstein          5

In [35]:
q2 = """SELECT book.title, favorite.user_id
FROM book
JOIN favorite ON book.id = favorite.book_id
WHERE favorite.user_id = 
    (SELECT user.id FROM user WHERE
    (user.last_name = "Doe" AND user.first_name = "John"));"""
pd.read_sql(q2, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1

## Part 3: Exporting the database and committing to GitHub

Now that you've created your database and verified it works, open MySQL Workbench and use the Export Database tool to save the .SQL file for your database in your assignment repository.

Add both of these files to your GitHub repository:

* Jupyter Notebook (including the ERD from Part 1 and code for Part 2)
* Exported .sql file.

Submit the repository link for this assignment.